import { defineStore } from 'pinia'

export interface Category {
    id: number
    name: string
    description: string
    productsName: string[]
}

export const useCategoriesStore = defineStore('categories', () => {
    const categories = [
        {
            id: 1,
            name: 'М’ясо та риба',
            description:
                'Продукти, що потребують зберігання в умовах заморозки або охолодження.',
            productsName: [
                'свіже м’ясо (яловичина, свинина, птиця)',
                'морожена риба',
                'фарш, субпродукти',
                'морепродукти',
            ],
        },
        {
            id: 2,
            name: 'Молочні продукти',
            description:
                'Чутливі до температури, з обмеженим терміном придатності.',
            productsName: [
                'молоко, кефір, йогурти',
                'вершки, сметана, масло',
                'сири (твердий, м’який)',
                'кисломолочні продукти',
            ],
        },
        {
            id: 3,
            name: 'Фрукти та овочі',
            description: 'Потребують зберігання з регульованою вологістю.',
            productsName: [
                'яблука, груші, цитрусові',
                'картопля, морква, капуста',
                'зелень',
                'ягоди',
            ],
        },
        {
            id: 4,
            name: 'Напівфабрикати та заморожені вироби',
            description:
                'Готові до приготування або з частковою термічною обробкою.',
            productsName: [
                'заморожені вареники, пельмені',
                'піца, млинці, нагетси',
                'тісто',
                'десерти/торти заморожені',
            ],
        },
        {
            id: 5,
            name: 'Продукти з особливими умовами зберігання',
            description:
                'Можуть вимагати нестандартних режимів (висока вологість, низький CO₂, тощо).',
            productsName: [
                'яйця',
                'кондитерські вироби з кремом',
                'ковбаси/делікатеси',
                'дієтичне/дитяче харчування',
            ],
        },
    ] as Category[]

    return {
        categories,
    }
})
