<template>
    <section class="margin-block">
        <div class="app-container container-md">
            <h1 class="ta-center mb-16">Про сервіс</h1>
            <p class="description">
                Команда, що створює інтелектуальні рішення для зберігання
                товарів у холодильних умовах. Ми віримо, що автоматизація — це
                не лише про ефективність, а й про турботу.
            </p>
        </div>
    </section>

    <section class="our-principe margin-block padding-block">
        <div class="app-container">
            <h2 class="ta-center mb-16">Наші принципи</h2>

            <div class="app-card-wrapper grid gap-32">
                <div class="app-card">
                    Ми про безпеку товарів: температурний режим, вологість,
                    контроль строків зберігання — усе це наша відповідальність.
                    Ми впевнені, що жодна партія не має бути втрачена через
                    людський фактор.
                </div>
                <div class="app-card">
                    Ми створюємо рішення, що полегшують роботу людей, а не
                    замінюють її. Автоматичні сповіщення, облік товарів,
                    прогнозування термінів — усе для швидкості, точності та
                    зручності.
                </div>
                <div class="app-card">
                    Інтерфейс повинен бути інтуїтивним. Ми проти складних форм,
                    заплутаних процесів і прихованих кнопок. Кожен користувач —
                    від комірника до адміністратора — має відчувати себе
                    впевнено.
                </div>
                <div class="app-card">
                    Ми про безпеку товарів: температурний режим, вологість,
                    контроль строків зберігання — усе це наша відповідальність.
                    Ми впевнені, що жодна партія не має бути втрачена через
                    людський фактор.
                </div>
                <div class="app-card">
                    Точність даних — основа наших рішень. Система зберігає
                    історію всіх дій, автоматично формує звіти та попереджає про
                    відхилення ще до того, як це стане проблемою.
                </div>
                <div class="app-card">
                    Інтерфейс повинен бути інтуїтивним. Ми проти складних форм,
                    заплутаних процесів і прихованих кнопок. Кожен користувач —
                    від комірника до адміністратора — має відчувати себе
                    впевнено.
                </div>
                <div class="app-card">
                    Точність даних — основа наших рішень. Система зберігає
                    історію всіх дій, автоматично формує звіти та попереджає про
                    відхилення ще до того, як це стане проблемою.
                </div>
                <div class="app-card">
                    Ми завжди поруч. Підтримка 24/7, навчання персоналу,
                    адаптація під реальні процеси вашого складу — наша система
                    масштабується разом із вашим бізнесом.
                </div>
                <div class="app-card">
                    Ми про безпеку товарів: температурний режим, вологість,
                    контроль строків зберігання — усе це наша відповідальність.
                    Ми впевнені, що жодна партія не має бути втрачена через
                    людський фактор.
                </div>
            </div>
        </div>
    </section>
</template>

<script lang="ts" setup></script>

<style lang="scss"></style>
